app/views/pdv/index.html.erb

SELECT "products"."nome", "products"."id" FROM "products"
---
        <%= form.label :pdv_product, 'Produto'%>
        <%= form.select :product_id,
      options_for_select(Product.select(:nome, :id).map { |e| [e.nome, e.id]}) %>