app/views/pdv/index.html.erb

SELECT "customers"."name", "customers"."id" FROM "customers"
---
      <%= form.label :customer, 'Cliente'%>
      <%= form.select :customer,
    options_for_select(Customer.select(:id, :name).map { |e| [e.name, e.id]}) %>

SELECT "origins"."id", "origins"."name" FROM "origins"
---
    <%= form.label :origin, 'Origem' %>
    <%= form.select :origin,
    options_for_select(Origin.select(:id, :name).map { |e| [e.name, e.id]})%>

SELECT "products"."nome", "products"."id" FROM "products"
---
        <%= form.label :pdv_product, 'Produto'%>
        <%= form.select :product_id,
      options_for_select(Product.select(:nome, :id).map { |e| [e.nome, e.id]}) %>

SELECT "payment_methods".* FROM "payment_methods"
---
<td colspan="2"><h5>Pagamento</h4></td>
<td colspan="2" class='pdv_input'><%= select_tag "payment", options_for_select(PaymentMethod.all.map { |e| [e.name, e.id] })%></td>