app/views/requests/_form.html.erb

SELECT "customers"."name", "customers"."id" FROM "customers"
---
      <%= form.label :cliente%>
      <%= form.select :customer_id,
      options_for_select(Customer.select(:name, :id).map { |e| [e.name, e.id]}) %>