app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "address", "number", "neighborhood", "cep", "created_at", "updated_at", "phone1", "phone2", "mailing") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "phone1" = ?, "phone2" = ?, "mailing" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["phone1", "11941932833"], ["phone2", ""], ["mailing", 1], ["updated_at", "2020-06-14 20:06:50.994320"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)