app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"