app/controllers/order_items_controller.rb

  def index
    @order_items = OrderItem.all
---
SELECT "order_items".* FROM "order_items"

    def set_order_item
      @order_item = OrderItem.find(params[:id])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]