app/controllers/origins_controller.rb

  def index
    @origins = Origin.all
---
SELECT "origins".* FROM "origins"

  def create
    @origin = Origin.new(origin_params)

    respond_to do |format|
      if @origin.save
---
INSERT INTO "origins" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Loja"], ["created_at", "2020-06-16 19:25:13.539153"], ["updated_at", "2020-06-16 19:25:13.539153"]]

    def set_origin
      @origin = Origin.find(params[:id])
---
SELECT "origins".* FROM "origins" WHERE "origins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]