app/controllers/pdv_controller.rb

class PdvController < ApplicationController
  protect_from_forgery with: :null_session
  def index
    @customers = Customer.select(:id, :name).order(:name).map { |e| [e.name, e.id]})
    @origins = Origin.select(:id, :name).order(:name).map { |e| [e.name, e.id]}
    @products = Product.select(:nome, :id).order(:name).map { |e| [e.nome, e.id]}
---
SELECT "customers"."name", "customers"."id" FROM "customers"
SELECT "origins"."id", "origins"."name" FROM "origins"
SELECT "name", "products"."id" FROM "products"

  def get_products
    @product = Product.find(params['product_id'])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_order
    order = Order.create(order_params)
    order_items_params.each do |e|
      e[:order_id] = order.id
      OrderItem.create(e)
---
INSERT INTO "orders" ("customer_id", "value", "payment", "origin", "request_ahead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["value", 86.0], ["payment", "Dinheiro"], ["origin", "Loja"], ["request_ahead", 0], ["created_at", "2020-06-17 12:53:47.615748"], ["updated_at", "2020-06-17 12:53:47.615748"]]
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["product_id", 1], ["quantity", 1.0], ["value", 8.0], ["created_at", "2020-06-17 12:53:48.088681"], ["updated_at", "2020-06-17 12:53:48.088681"]]