app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("nome", "tipo", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Bolo Fatia"], ["tipo", "Bolo"], ["preco", 8.0], ["created_at", "2020-06-12 14:21:22.633475"], ["updated_at", "2020-06-12 14:21:22.633475"]]