app/controllers/requests_controller.rb

  def index
    @requests = Request.where("delivery_date >= '#{Date.today}'")
---
SELECT "requests".* FROM "requests" WHERE (delivery_date >= '2020-06-14')

  def create
    byebug
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("customer_id", "mailing", "items", "delivery_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["mailing", 1], ["items", "asdfasdfasdf"], ["delivery_date", "2020-06-14"], ["created_at", "2020-06-14 16:40:04.716711"], ["updated_at", "2020-06-14 16:40:04.716711"]]

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "delivery" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["delivery", 1], ["updated_at", "2020-06-14 17:43:44.659205"], ["id", 2]]

    def set_request
      @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]